[{"name": "Superfood salad", "description": "Full of great veggies and high-fibre quinoa, this easy-to-make salad is nutritious, delicious and super-satisfying. Top with juicy pomegranate seeds for a great burst of flavour.", "image": "https://img.jamieoliver.com/jamieoliver/recipe-database/oldImages/large/1460_1_1436891540.jpg", "video": "", "ingredients": ["2 sweet potatoes (350g each)", "1 pinch of dried chilli flakes", "1 pinch of ground coriander", "1 small pinch of ground cinnamon", "olive oil", "200 g quinoa", "320 g broccoli", "35 g mixed nuts such as walnuts, almonds, Brazils", "1 pomegranate", "extra virgin olive oil", "1 splash of balsamic vinegar", "2 limes", "40 g mixed sprouts", "1 punnet of salad cress (use a mixture of varieties, if possible)", "1 bunch of fresh coriander (30g)", "1 fresh red chilli", "1 ripe avocado", "20 g feta cheese"], "steps": ["Preheat the oven to 200°C/400°F/gas 6.", "Scrub and chop the sweet potatoes into 2.5cm chunks. Place into a roasting tray with the chilli flakes, ground coriander and cinnamon, a drizzle of olive oil and a little sea salt and black pepper, then toss well.", "Spread out into an even layer and place in the hot oven for 15 to 20 minutes, or until golden and crisp.", "Meanwhile, cook the quinoa in boiling salted water according to the packet instructions.", "Slice the broccoli into small florets, then halve and finely slice the stalk. Place into a heatproof colander and rest it over the quinoa pan. Cover and steam for 3 minutes, or until just tender.", "Once cooked, drain and rinse the quinoa under cold running water, then leave to cool along with the broccoli. Remove the sweet potato from the oven and leave it to cool, too.", "Meanwhile, toast the nuts in a dry frying pan over a medium-high heat for 2 to 3 minutes, then transfer to a pestle and mortar and crush lightly.", "Halve the pomegranate and squeeze half the juice into a large bowl. Add 3 times as much extra virgin olive oil, the lime juice and balsamic vinegar. Whisk well and season to taste.", "Add the cooled broccoli and sprouts to the dressing, then snip in the cress. Roughly chop the coriander (stalks and all), finely slice the chilli and add to the bowl along with the quinoa and sweet potato.", "Toss well, spread out on a serving platter, then scoop out and dot over the avocado flesh.", "Bash the reserved pomegranate half with a wooden spoon so the seeds come tumbling out and scatter these over the platter along with the nuts, snip the cress on top, then serve with the feta crumbled over the top."], "servings": 6, "time": 40}, {"name": "Cheat's pea soup", "description": "This super-speedy soup recipe utilizes freezer staples peas and spinach, both of which give us vitamin C, helping us to absorb the all-important iron contained in the pasta.", "image": "https://img.jamieoliver.com/jamieoliver/recipe-database/134454529.jpg", "video": "", "ingredients": ["1 bunch of spring onions", "300 g frozen peas", "300 g frozen chopped spinach", "100 g higher-welfare smoked ham", "½ a bunch of fresh mint (15g)", "300 g dried wholewheat fusilli", "50 g feta cheese"], "steps": ["Trim 1 bunch of spring onions and place in a blender with 300g of frozen peas and 300g of frozen spinach.", "Tear in 100g of smoked ham, pick in the leaves from ½ a bunch of fresh mint (15g), then cover with 400ml of boiling kettle water.", "Put the lid on securely, cover with a tea towel and, holding it in place, blitz until smooth, stopping to scrape down the sides and help it along, if needed. Pour into a large pan on a high heat and add another 1.2 litres of boiling kettle water.", "Smash up 300g of wholewheat fusilli into random shapes – the easiest way is to wrap it in a tea towel and attack it with a rolling pin – and stir into the soup.", "Bring back to the boil, then simmer until the pasta is cooked through, stirring regularly and adding splashes of water to loosen, if needed. Taste the soup, and season to perfection.", "Divide the soup between bowls or mugs, then use a speed-peeler to shave over 50g of feta in fine strips, before tucking in."], "servings": 4, "time": 24}, {"name": "One-pan veggie lasagne", "description": "Twisted, rustic layers of beautiful lasagne and delicate veg that can be cooked, baked and served in just one pan. Enjoy!", "image": "https://img.jamieoliver.com/jamieoliver/recipe-database/134657931.jpg", "video": "watch?v=ynYyM7NiPj0", "ingredients": ["1 leek", "50 g unsalted butter", "olive oil", "500 g asparagus", "50 g plain flour", "2 teaspoons English mustard", "800 ml semi-skimmed milk", "300 g fresh or frozen peas", "300 g fresh or frozen broad beans", "½ a bunch of fresh mint (15g)", "80 g Parmesan cheese plus extra to serve", "80 g mature Cheddar cheese", "250 g fresh lasagne sheets", "50 g blanched almonds", "1 lemon optional", "green pesto optional"], "steps": ["Preheat the oven to 200ºC/400ºF/gas 6.", "Wash, trim and slice 1 leek (see tip) and place in a large shallow ovenproof pan on a medium-low heat with 50g of unsalted butter and a splash of olive oil.", "Line up 500g of asparagus, trim off the woody ends, then finely slice and add the stems to the pan, reserving the tips for later.", "Season with sea salt and black pepper, then fry on a medium-low heat for 10 minutes, or until sweet, soft and delicious, stirring regularly and adding a splash of water, if needed.", "Stir in 50g of plain flour, followed by 2 teaspoons of English mustard, and slowly stir in 800ml of semi-skimmed milk to give you a loose white sauce, then leave to blip away for a few minutes.", "Stir in 300g each of peas and broad beans and leave to warm through while you rip off, roughly chop and stir in the leaves from ½ a bunch of fresh mint (15g).", "Smash up the veg for 1 minute with a potato masher, then grate in 70g each of Parmesan and Cheddar and add the asparagus tips.", "Tear in the pasta sheets, mix up really well to coat and separate, then pull some of the sheets to the top to create a top layer – use the back of a spoon to create some dips and wells.", "Roughly bash the almonds so you have a mixture of fine and chunky bits, then sprinkle on top and grate over the remaining 10g each of Parmesan and Cheddar cheese. Finish with a drizzle of olive oil and a few scrapings of lemon zest (if using).", "Bake for 20 to 25 minutes, or until golden and bubbling. Serve topped with a little dollop of pesto (if using), a crunchy green salad and an extra grating of Parmesan, if you like."], "servings": 6, "time": 45}, {"name": "Beautiful courgette carbonara", "description": "Carbonara is a classic pasta sauce made with cream, bacon and Parmesan and is absolutely delicious. I've added gorgeous courgettes for a summery twist. Try to buy the best ingredients you can, as that’s what really helps to make this dish amazing. I’m using a flowering variety of thyme but normal thyme is fine to use. When it comes to the type of pasta, you can serve carbonara with spaghetti or linguine, but I’ve been told by Italian mammas (who I don’t argue with!) that penne is the original, so that’s what I’m using in this recipe. Before you start cooking, it’s important to get yourself a very large pan, or use a high-sided roasting tray so you can give the pasta a good toss.", "image": "https://img.jamieoliver.com/jamieoliver/recipe-database/94356757.jpg", "video": "", "ingredients": ["6 medium green and yellow courgettes", "500 g penne", "4 large free-range eggs", "100 ml single cream", "1 small handful of Parmesan cheese", "olive oil", "6 slices of higher-welfare back bacon", "½ a bunch of fresh thyme (15g)", "a few courgette flowers (optional)"], "steps": ["Put a large pan of salted water on to boil.", "Halve and then quarter any larger courgettes lengthways. Cut out and discard any fluffy middle bits, and slice the courgettes at an angle into pieces roughly the same size and shape as the penne. Smaller courgettes can simply be sliced finely.", "Your water will now be boiling, so add the penne to the pan and cook according to the packet instructions.", "To make your creamy carbonara sauce, separate the eggs and put the yolks into a bowl (saving the whites for another recipe). Add the cream and grate in half the Parmesan, and mix together with a fork. Season lightly with sea salt and black pepper, and put to one side.", "Heat a very large frying pan (a 35cm one is a good start – every house should have one!) and add a good splash of olive oil. Cut the pancetta or bacon into chunky lardons and fry until dark brown and crisp.", "Add the courgette slices and 2 big pinches of black pepper, not just to season but to give it a bit of a kick. Pick, chop and sprinkle in the thyme leaves (reserving any flowers), give everything a stir, so the courgettes become coated with all the lovely bacon-flavoured oil, and fry until they start to turn lightly golden and have softened slightly.", "It’s very important to get this next bit right or your carbonara could end up ruined. You need to work quickly. When the pasta is cooked, drain it, reserving a little of the cooking water. Immediately, toss the pasta in the pan with the courgettes, bacon and lovely flavours, then remove from the heat and add a ladleful of the reserved cooking water and your creamy sauce. Stir together quickly. (No more cooking now, otherwise you’ll scramble the eggs.)", "Get everyone around the table, ready to eat straight away. While you’re tossing the pasta and sauce, grate in the rest of the Parmesan and add a little more of the cooking water if needed, to give you a silky and shiny sauce. Taste quickly for seasoning.", "If you’ve managed to get any courgette flowers, tear them over the top, then serve and eat immediately, as the sauce can become thick and stodgy if left too long."], "servings": 6, "time": 20}, {"name": "Roasted parsnips", "description": "The acidity of the vinegar cuts through the sweetness of the parsnips beautifully here, and the combo of bay and honey adds a real festive feel. For the best results, don’t peel them.", "image": "https://img.jamieoliver.com/jamieoliver/recipe-database/116851410.jpg", "video": "", "ingredients": ["1.5 kg medium parsnips", "50 g unsalted butter", "4 fresh bay leaves", "1 tablespoon white or red wine vinegar", "2 tablespoons runny honey"], "steps": ["Preheat the oven to 180ºC/350ºF/gas 4.", "Scrub the parsnips, then blanch whole in a large pan of boiling salted water for 5 minutes, then drain and steam dry.", "Tip into a large roasting tray, dot over the butter and a pinch of sea salt and black pepper, toss to coat and arrange in a single layer, then roast for 1 hour.", "Remove the tray from the oven, quickly scatter over the bay leaves and drizzle with the vinegar and honey, then toss together and roast for a final 10 minutes, or until beautifully golden."], "servings": 8, "time": 80}, {"name": "Butterflied prawn skewers", "description": "Zingy and fresh, these barbecue prawns are an absolute joy to eat. Watermelon is just so refreshing in summer, and the hum of onion, crunch of cucumber and sprinkling of tangy feta make this salad the perfect accompaniment.", "image": "https://img.jamieoliver.com/jamieoliver/recipe-database/114185878.jpg", "video": "", "ingredients": ["2 lemons", "3 cloves of garlic", "1 bunch of fresh flat-leaf parsley (30g)", "olive oil", "320 g large raw shell-on king prawns from sustainable sources", "extra virgin olive oil", "½-1 fresh red chilli", "½ a bunch of fresh mint (15g)", "½ a red onion", "1 small watermelon", "1 cucumber", "100 g feta", "8 rashers of higher-welfare smoked pancetta or streaky bacon"], "steps": ["First up, if you’re using wooden skewers, soak some in cold water for 10 minutes, so they don't burn when you put them on the barbie later.", "Finely grate the zest of 1 lemon into a large bowl, then squeeze in its juice. Peel the garlic and pound into a rough paste in a pestle and mortar with a pinch of sea salt and black pepper. Tear in half of the parsley leaves, smash together, then add to the bowl with 1 tablespoon of oil.", "Pull the heads off the prawns and peel off the shells, leaving the tails intact. Run the tip of your knife down their backs and pull out the vein to butterfly them. Toss the prawns in the marinade, then cover and pop in the fridge for 30 minutes.", "For the salad, squeeze the remaining lemon juice onto a serving platter and add 2 tablespoons of extra virgin olive oil. Finely slice and add as much chilli as you like, then tear over the remaining parsley and mint leaves. Peel and very finely slice the red onion, then toss into the dressing and herbs on the platter.", "Chop the top and bottom off the watermelon, then sit it on one of the flat sides and slice off the peel. Chop the flesh into 1½cm-wide strips, then into 1cm dice, discarding the seeds, and add to the platter.", "Chop the cucumber and feta into 1cm chunks and add to the party, then use your fingertips to gently toss it all together.", "Take a bit of pride in skewering up the prawns, interlacing them with the pancetta as you go – don’t pack it on too tightly.", "Cook the skewers on the barbecue for about 3 minutes on each side, or until the bacon is crisp and the prawns are pink, then serve on top of the salad."], "servings": 4, "time": 40}, {"name": "Buddy's quick pizzettas", "description": "Check out more of our recipes!", "image": "https://img.jamieoliver.com/jamieoliver/recipe-database/110328892.jpg", "video": "", "ingredients": ["350 g self-raising flour, plus extra for dusting", "olive oil", "250 g natural yoghurt", "2 cloves of garlic", "1 x 400 g tin of quality plum tomatoes", "½ a bunch of fresh basil (15g)", "1 fresh red chilli", "50 g Cheddar cheese", "30 g Parmesan cheese", "150 g mozzarella cheese", "4 chestnut mushrooms", "2 slices of higher-welfare cooked ham"], "steps": ["Preheat the oven to 240°C/475°F/gas 9 (full whack) or as hot as it will go. Place 2 large baking trays in to heat up.", "Place the flour in a large bowl with a small pinch of salt, 1 tablespoon of olive oil and the yoghurt. Mix well with a spatula until you can’t move it anymore, then use your clean hands to form it into a dough. Turn onto a board and knead for a few minutes until smooth. Plop it back into the bowl, cover with a cloth and leave to one side while you make your sauce.", "Peel and finely slice the garlic and place in a medium pan on a medium heat with 1 tablespoon of oil. Cook for 1 minute, then pour in the tomatoes. Use a potato masher to squash everything down to make a lovely smooth sauce. Cook for 10 minutes, or until thickened, then tear in most of the basil, season to perfection and set aside.", "Now for the fun bit. Place your dough on a flour-dusted surface and divide into 8 pieces. Line up all your toppings so they’re ready to go: finely chop the red chilli and grate the Cheddar and Parmesan cheeses. Pick the remaining basil leaves (and finely chop, if you like), thinly slice the mushrooms. and tear the ham into small pieces. Roll the pieces of dough into thin rounds, stacking them up between sheets of greaseproof paper as you go to stop them sticking.", "Carefully remove the baking trays from the oven (get an adult to help you with this bit!). Transfer your pizza bases to the hot trays and, working quickly, spoon over the tomato sauce over each base, spreading out with a spoon. Tear over the mozzarella and add your favourite toppings. Pop the trays back in the oven and cook for 10 minutes, or until the bases are crispy and the cheese is bubbling. Slice into triangles and serve with a side salad."], "servings": 8, "time": 30}, {"name": "Fish finger tacos", "description": "Build-up your handy freezer stash with these simply tasty homemade fish fingers – they're perfect for those extra-busy days when you need to get dinner on the table, fast.", "image": "https://img.jamieoliver.com/jamieoliver/recipe-database/134456370.jpg", "video": "", "ingredients": ["1.2 kg white fish fillets skin off, pin-boned, from sustainable sources", "100 g plain flour", "2 large free-range eggs", "2 teaspoons chipotle paste", "250 g wholemeal bread", "olive oil", "¼ of a red cabbage (150g)", "white wine vinegar", "2 corn on the cob", "1 lime", "extra virgin olive oil", "4 wholemeal tortillas", "natural yoghurt or soured cream to serve"], "steps": ["Cut 1.2kg of white fish into 10 portions (120g each) – they won’t be uniform in size, but don’t worry.", "Sprinkle 100g of plain flour across a plate, then whisk 2 large eggs and 2 teaspoons of chipotle paste together in a shallow bowl.", "Whiz 250g of wholemeal bread in a food processor with 2 tablespoons of olive oil and a pinch of sea salt and black pepper, then tip onto a baking tray.", "Coat each piece of fish in the flour, then dip into the egg mixture, letting any excess drip off. Finally, turn in the breadcrumbs until well coated, then transfer to a lined baking tray.", "At this stage you can cook them right away, or freeze on the tray (once frozen, you can pop them into a tub or freezer bag for easy storage).", "To cook, place the fish fingers on a roasting tray (one per person) and cook in a preheated oven at 200°C/400°F/gas 6 for 15 minutes from fresh or 20 minutes from frozen, or until golden and cooked through.", "Meanwhile, finely slice ¼ of a red cabbage (150g), then add to a bowl with 2 tablespoons of white wine vinegar and a pinch of salt. Scrunch together well and set aside to pickle.", "Pop a griddle pan or frying pan on a high heat, once hot add the corn and grill for around 10 minutes, or until lightly charred all over. Leave to cool slightly then carefully run a knife down the sides of the corn to cut off the kernels.", "Transfer the corn to a bowl, finely grate over the zest of 1 lime, add 1 tablespoon of extra virgin olive oil, then toss together and season to taste.", "Warm the tortillas in the oven wrapped in damp greaseproof paper, tip the yoghurt or soured cream into a serving bowl and cut the zested lime into wedges for squeezing over, then take everything to the table and let everyone tuck in and build their own."], "servings": 4, "time": 45}, {"name": "Strawberry & cream sandwich sponge", "description": "This classic cake is, of course, named after Queen Victoria, the only monarch to reign longer than the current Queen. It’s relatively easy to make but does have a few quirks: you need to get as much air into it as possible, and be mindful of its sensitivity to variations in heat. Know your oven well and invest in an oven thermometer!", "image": "https://img.jamieoliver.com/jamieoliver/recipe-database/6enK0UcnKWp8Zx3cZ_Pa_P.jpg", "video": "", "ingredients": ["225 g unsalted butter (at room temperature) plus extra for greasing", "225 g white caster sugar", "1 teaspoon vanilla extract", "4 large free-range eggs", "225 g self-raising flour", "1 teaspoon baking powder", "1 splash of milk", "200 ml double cream", "1 vanilla pod", "1½ tablespoon of icing sugar plus extra for dusting", "250 g fresh strawberries"], "steps": ["Preheat the oven to 180ºC/gas 4. Grease and line the bases of 2 round 20cm sandwich tins.", "Cube up the butter, then cream together with the sugar in a large mixing bowl until pale and fluffy. Mix in the vanilla extract.", "Beat the eggs, then gradually mix into the creamed butter and sugar. Sift, then fold in the flour, baking powder and ¼ of a teaspoon of sea salt with a large metal spoon until just incorporated (don’t overmix).", "Stir in 1 splash of milk to loosen the batter, then evenly divide it between the 2 cake tins.", "Bake the cakes in the oven for 22 to 25 minutes, or until golden and cooked through. To test, insert a skewer into the middle of a cake; it’s ready when the skewer comes out clean. Leave to cool in the tins for 5 minutes, then turn onto a wire rack to cool completely.", "Once completely cool, pour the cream into a large bowl, scrape in the vanilla seeds and whisk until you have soft peaks.", "Sift in icing sugar and gently fold through. Place one of the cakes on your chosen plate or cake stand and spread over the vanilla cream, but not right to the edges or it will spill later.", "Hull and roughly slice the strawberries, then scatter on top of the second cake. Dust with icing sugar and decorate with extra strawberries, if you like."], "servings": 14, "time": 50}, {"name": "Chai spiced carrot cake", "description": "If you like carrot cake, you’ll love this chai-spiced traybake recipe from Bake Off winner Edd Kimber. Perfect with a cuppa, or give it as a gift. Yum!", "image": "https://img.jamieoliver.com/jamieoliver/recipe-database/46262449.jpg", "video": "", "ingredients": ["250 ml vegetable oil, plus extra for greasing", "4 large carrots", "1 large lemon", "100 g currants or sultanas", "100 g pecans", "280 g plain flour", "2 teaspoons baking powder", "1 tablespoon ground ginger", "1 tablespoon ground cinnamon", "2 teaspoons ground cardamom", "¼ teaspoon ground cloves", "¼ teaspoon ground anise", "¼ teaspoon ground nutmeg", "4 tablespoons candied ginger in syrup", "1 black tea bag", "2 large free-range eggs", "200 g caster sugar", "200 g light brown sugar", "30 g flaked coconut", "200 g unsalted butter (at room temperature)", "200 g cream cheese", "125 g icing sugar"], "steps": ["Preheat the oven to 180ºC/350ºF/gas 4. Grease and line a 20cm x 30cm traybake tin.", "Peel and grate the carrots into a large bowl, then grate in the lemon zest. Mix in the currants, then roughly chop and add the pecans.", "In another bowl, combine the flour, baking powder, all the spices and ½ a teaspoon of sea salt. Dice and add the ginger, then split open the tea bag, pour in the leaves, and mix well.", "Whisk the eggs in a mixing jug, then mix in both sugars and the vegetable oil. Pour over the carrots, give it a good stir, then add the dry ingredients and mix until just combined.", "Pour the batter into the pan and bake in the oven for 55 minutes, or until a skewer inserted into the centre comes out clean.", "Allow to cool in the tin for 15 minutes, then remove from the tin and invert onto a wire rack to cool completely.", "Meanwhile, for the buttercream, place the butter in the bowl of a free-standing mixer and beat for about 5 minutes, or until creamy.", "Add the cream cheese and beat until just combined. Next, add the icing sugar and beat again until smooth – don't overmix it, or your icing will be runny! Chill in the fridge for at least 15 minutes, then spoon over the cake and spread out evenly.", "Toast the coconut in a dry frying pan over a medium heat for 3 minutes, or until lightly golden, tossing occasionally. Scatter over the iced cake, then slice up and enjoy!"], "servings": 10, "time": 80}, {"name": "Rhubarb & custard tart", "description": "Perfect poached rhubarb in a crumbly pastry tart case, with a layer of creamy custard – yes please!", "image": "https://img.jamieoliver.com/jamieoliver/recipe-database/134397325.jpg", "video": "", "ingredients": ["500 g plain flour", "100 g icing sugar plus 1 teaspoon", "250 g unsalted butter (cold)", "3 large free-range eggs", "4 tablespoons whole milk", "1 teaspoon vanilla bean paste", "vegetable oil for greasing", "50 g flaked almonds", "1 kg rhubarb", "500 g mixed eating apples", "160 g golden caster sugar", "500 ml whole milk", "3 level tablespoons custard powder", "2 teaspoons vanilla bean paste"], "steps": ["To make the pastry, sieve 500g of plain flour and 100g of icing sugar into a large bowl.", "Chop 250g of unsalted butter into cubes, then, using your fingertips, gently work it into the flour and sugar until the mixture resembles breadcrumbs (or simply pulse in a food processor).", "Beat 2 large eggs with 4 tablespoons of whole milk and 1 teaspoon of vanilla bean paste, then add to the flour mixture and gently work it together until it forms a ball of dough.", "Divide the dough in half, cover each piece and pop into the fridge to rest for 30 minutes.", "Roll one of the pieces of pastry out into a round, about ½cm thick. Lightly grease a 24cm non-stick loose-bottomed tart tin with vegetable oil. Line the base and sides with the pastry. Prick the bottom with a fork, then place back in the fridge until needed.", "Preheat the oven to 180°C/350°F/gas 4.", "Meanwhile, make the filling. Trim 1kg of rhubarb and peel and core 500g of eating apples, then chop into 3cm chunks and place into a large pan with 125g of golden caster sugar, and a splash of water. Simmer on a medium heat for 15 minutes, or until tender, then strain through a colander, catching the liquid in a bowl.", "Tip the strained liquid back into the pan and simmer over a medium heat for 5 minutes, or until thick and syrupy. Remove from the heat and leave to cool.", "Scrunch up a large piece of greaseproof paper, then unwrap it and use it to line your pastry case, pushing it right into the sides. Fill the case with rice or baking beans, and bake blind for 10 minutes.", "Carefully remove the rice or baking beads (save for another bake) and return to the oven for a further 10 minutes, or until golden and crisp.", "Pour 500ml of whole milk into a pan over a medium-low heat, whisk in 3 level tablespoons of custard powder, the remaining 35g of golden caster sugar, 2 teaspoons of vanilla bean paste. Whisk in a figure of 8 until the mixture becomes really thick, then pour into the pastry case and leave to cool.", "For your pie lid, roll the remaining pastry out into a circle, just under 1cm thick (it will be larger than you need, but the excess can be used for decorating).", "Carefully spoon the apples and rhubarb over the custard base. Beat the remaining egg, then use it to eggwash the edges of the pie. Top with the pie lid, gently tuck in slightly, then roll over the top with your rolling pin to trim away the excess pastry.", "Use the excess pastry to decorate the top of your pie, however you like. Brush with a little more beaten egg to glaze, then toss 50g of flaked almonds in 1 teaspoon of icing sugar and a tiny splash of water, then sprinkle over the top.", "Bake for 40 to 45 minutes, or until golden. Delicious served with more custard and the beautiful fruit syrup drizzled over."], "servings": "10", "time": "PT2H30M"}]